<template>
  <div class="intro-install">
    <template v-if="!props.isEng">
      <h2>
        Стилизация маркированных областей
      </h2>

      <p>
        В процессе работы возникают такие ситуации, при которых нам нужно отобразить маркированные области, и при этом некоторые маркированные области должны отличаться. В качестве примера я могу привести такой пример. Представьте, что мы маркировали картинку, отправили данные на сервер, а дальше одни маркированные области нейронка распознать не смогла, другие маркированные области нейронка распознала, но распознала с ошибкой, к примеру документ отсканирован не чётко, и некоторые буквы не получилось распознать. Другая часть маркированных областей распозналась нормально, без ошибок. Нам пришёл ответ в виде массива объектов, одно из свойтв каждого объекта говорит нам о результате распознавания, и нам нужно как-то отобразить результат пользователю, чтобы он смог понять какие маркированные области разпознать не удалось, какие маркированнеы области рапознались с ошибкой, а какие маркированные области  распознались без ошибок. Подобные задачи можно решить как через CSS-классы,так и через аттрибут "style".
      </p>

      <h3>
        Стилизация маркированных областей через CSS классы
      </h3>

      <p>
        Наверное это самый гибкий способ. Всё, что для этого нужно, это задать для раждого объекта в массиве свойство "muClass" с нужным нам классом, или классами, а дальше прописать стили для каждого класса. Чтобы было удобнее, поудобнее, я ниже перечислю CSS-переменные отвечающие за стилизацию маркированных лбластей:
      </p>

      <ul>
        <li>--mu-marking-rect-stroke-width</li>
        <li>--mu-marking-rect-stroke-opacity</li>
        <li>--mu-marking-rect-fill-opacity</li>
        <li>--mu-marking-rect-rx</li>
        <li>--mu-marking-rect-ry</li>
        <li>--mu-marking-rect-fill</li>
        <li>--mu-marking-rect-stroke</li>
        <li>--mu-marking-rect-active-fill</li>
        <li>--mu-marking-rect-active-stroke</li>
        <li>--mu-marking-rect-active-fill-opacity</li>
        <li>--mu-marking-rect-active-stroke-opacity</li>
      </ul>
    </template>

    <template v-if="props.isEng">
      <h2>
        Stylization of labeled areas
      </h2>
    </template>
  </div>
</template>

<script setup>
  const props = defineProps(['isEng', 'query']);
</script>

<style lang="scss">
  
</style>
