<template>
  <div class="stilization-areas">
    <template v-if="!props.isEng">
      <h2>
        Стилизация маркированных областей
      </h2>

      <p>
        В процессе работы возникают такие ситуации, при которых нам нужно отобразить маркированные области (пришёл какой-то результат с сервера), и при этом некоторые маркированные области должны отличаться. В качестве примера давайте представим себе такую ситуацию. Мы маркировали картинку, отправили данные на сервер, а дальше одни маркированные области нейронка распознать не смогла, другие маркированные области нейронка распознала, но распознала с ошибкой, к примеру документ отсканирован не чётко, и некоторые буквы не получилось распознать. Другая часть маркированных областей распозналась нормально, без ошибок. Нам пришёл ответ в виде массива объектов. Одно из свойств каждого объекта говорит нам о результате распознавания, и нам нужно как-то отобразить результат пользователю, чтобы он смог понять какие маркированные области разпознать не удалось, какие маркированные области рапознались с ошибкой, а какие маркированные области  распознались без ошибок. Подобные задачи можно решить как через CSS-классы, так и через аттрибут "style".
      </p>

      <p>
        Самое правильное будет сказать о том, что мы можем стилизовать. Выше я уже приводил CSS-переменные которые отвечают за стилизацию. Чтобы было удобнее, и не приходилось скакать по странице, ниже я ещё раз приведу список CSS-переменных отвечающих за стилизацию маркированных областей. Условно их можно разделить на переменные отвечающие за стилизацию обычных маркированных областей, переменные отвечающие за стилизацию активной маркированной области, и общие переменные, которые имеют отношение как к обычным, так и к активной маркированной области. Если вы больше практик, то я бы посоветовал вам открыть <ui-link
          type="site"
          href="examples"
          title="Страница примеров"
          :query="query"
        >страницу примеров</ui-link>, и посмотреть примеры стилизации маркированных областей, вам так будет проще. Если же вы хотите более детально во всём разобраться, то читайте дальше.
      </p>

      <h3>
        Общие CSS-переменные
      </h3>

      <p>
        Это переменные, изменения которых приведут к изменению как активной, так и обычных маркированных областей. Обычно разница между активной и обычной маркированной областью заключается в цвете линии, цвете заливки и прозрачности заливки. Закругления и толщина линий как правило не отличаются, по крайней мере в том, что я делал было так.
      </p>

      <p class="small-mar">
        <b>--mu-marking-rect-rx</b> — border-radius по оси X, или закругление по оси X. Этот параметр применяется для активной и обычной маркированной области. Очень маловероятно, что возникнет такая ситуация, при которой закругление для активной области будет отличаться от обычной.
      </p>

      <p class="small-mar">
        <b>--mu-marking-rect-ry</b> — border-radius по оси Y, или закругление по оси Y. Этот параметр применяется для обычной и активной маркированной области. Могу сказать, что так-же как и для параметра выше, очень маловероятно, что возникнет такая ситуация, при которой закругление для активной области будет отличаться от обычной. 
      </p>
      <p class="small-mar">
        <b>--mu-marking-rect-stroke-width</b> — толщина линий маркированных областей. Этот параметр  так-же применяется для обычной и активной маркированной области. У меня не возникало таких задач, чтобы маркированные области отличались по толщине линий, но в последнее время я об этом задумываюсь, вполне возможно, что в следующих версиях я этот момент поправлю. 
      </p>

      <h3>
        CSS-переменные отвечающие за стилизацию обычных маркированных областей
      </h3>

      <p>
        Это переменные которые будут применяться к обычным маркированным областям. Когда мы начинаем маркировать изображение, то первая созданная область будет активной. После, активной будет каждая последняя созданная маркированная область. Мы можем запретить маркировать изображение и просто отобразить маркированные области, тогда активной маркированной области не будет. Для обычных маркированных областей мы можем задавать цвет линии и цвет её заливки. Так-же мы можем менять прозрачность заливки и прозрачность линии.
      </p>

      <p class="small-mar">
        <b>--mu-marking-rect-fill</b> — цвет заливки для маркированных областей. Здесь можно задать любое допустимое значение цвета в CSS (orange, blue, rgba(77, 77, 77, .7), rgb(77, 77, 77), hsl(120, 100%, 50%) и тд).
      </p>
      <p class="small-mar">
        <b>--mu-marking-rect-fill-opacity</b> — прозрачность заливки для маркированных областей. Если вам не нужна заливка, по задумке дизайнера её нет, то задайте 0. Допустимые значения от 0 до 1 (0, 1, 0.3, 0.4, 0.8 и тд).
      </p>
      <p class="small-mar">
        <b>--mu-marking-rect-stroke</b> — цвет линии для маркированных областей, по другому можно сказать border, под капотом я использую SVG, поэтому данная переменная в названии содержит "stroke". Здесь можно задать любое допустимое значение цвета в CSS (orange, blue, rgba(77, 77, 77, .7), rgb(77, 77, 77), hsl(120, 100%, 50%) и тд).
      </p>
      <p class="small-mar">
        <b>--mu-marking-rect-stroke-opacity</b> — прозрачность линий для маркированных областей. Если по дизайну у маркированных областей нет видимых линий, а есть только заливка, то задайте значение 0. Как правило обычно задают 1. Допустимые значения от 0 до 1 (0, 1, 0.3, 0.4, 0.8 и тд).
      </p>

      <h3>
        CSS-переменные отвечающие за стилизацию активной маркированной области
      </h3>

      <p>
        Скажу честно, у меня не возникало таких задач, чтобы было нужно стилизовать активную маркированную область. Обычно, в большинстве проектов которые я делал, если мне приходил ответ от сервера, то с результатом можно было только ознакомиться, редактирование маркированных областей я отключал (:is-readonly="true" для моего компонента). Скорее всего эти переменные вам тоже не понадобятся, но если делать универсально, то я предусмотрел возможность менять стили для активной маркированной области. Смотрите, если вы разрешите изменять маркированные области (разрешите переносить и растягивать их), то при клике на обычную маркированную область она станет активной, к ней применятся те стили, которые применются для активной маркированной области по умолчанию. Если вы стилизовали данную область, то при клике по ней всё равно применятся стили для активной маркированной области по умолчанию. Если вам такое поведение не нужно, то вам нужно будет переопределить нужные вам переменные. Так-же как и для обычных маркированных областей, мы можем задавать цвет заливки, цвет линии, а так-же прозрачность заливки и прозрачность линии активной маркированной области.
      </p>

      <p class="small-mar">
        <b>--mu-marking-rect-active-fill</b> — цвет заливки для активной маркированной области. Здесь можно задать любое допустимое значение цвета в CSS (orange, blue, rgba(77, 77, 77, .7), rgb(77, 77, 77), hsl(120, 100%, 50%) и тд).
      </p>
      <p class="small-mar">
        <b>--mu-marking-rect-active-fill-opacity</b> — прозрачность заливки для активной маркированной области. Если вам не нужна заливка, по задумке дизайнера её нет, то задайте 0. Допустимые значения от 0 до 1 (0, 1, 0.3, 0.4, 0.8 и тд).
      </p>
      <p class="small-mar">
        <b>--mu-marking-rect-active-stroke</b> — цвет линии для активной маркированной области, по другому можно сказать border, под капотом я использую SVG, поэтому данная переменная в названии содержит "stroke". Здесь можно задать любое допустимое значение цвета в CSS (orange, blue, rgba(77, 77, 77, .7), rgb(77, 77, 77), hsl(120, 100%, 50%) и тд).
      </p>
      <p class="small-mar">
        <b>--mu-marking-rect-active-stroke-opacity</b> — прозрачность линии для активной маркированной области. Если по дизайну у активной маркированной области нет видимых линий, а есть только заливка, то задайте значение 0. Как правило обычно задают 1. Допустимые значения от 0 до 1 (0, 1, 0.3, 0.4, 0.8 и тд).
      </p>

      <h3>
        Стилизация маркированных областей через CSS классы
      </h3>

      <p>
        Наверное это самый гибкий способ для стилизации маркированных областей. Смотрите, мы получаем от сервера массив маркированных областей, одно из свойств каждой маркированной области говорит нам о результате распознавания маркированной области. Всё, что нам нужно, это заменить данное свойство на "muClass" с нужным нам CSS классом, или классами, а дальше прописать стили для каждого CSS класса. Ниже я приведу условный пример кода по стилизации маркированных областей через CSS классы. Наиболее важные места, где я задаю CSS классы, и стилизую маркированные области я выделю (рядом с номером строки будет зелёная линия). Я бы вам посоветовал открыть <ui-link
          type="site"
          href="examples"
          title="Страница примеров"
          :query="query"
        >страницу примеров</ui-link> и посмотреть реальные примеры.
      </p>

      <stilization-class />

      <p>
        Пример выше весьма условный, в нём я не разрешаю маркировать картинку (:is-markup="false"), нам пришёл ответ от сервера и нам нужно где-то растянуть маркированную область, где-то её переместить, а вот новые маркированные области нам создавать не нужно. Я задал для не распознанных маркированных областей CSS-класс "mu-class_error". Для тех маркированных областей, которые распознались с ошибкой, я задал класс "mu-class_warn". Для нормально распознанных областей я задал класс "mu-class_success". В примере выше я не меняю цвета для активной маркированной области, но, для того, чтобы как-то её выделить, я делаю толще линию обводки и меняю прозрачность заливки, так будет понятно, что область стала активной.
      </p>

      <h3>
        Стилизация маркированных областей через атрибут "style"
      </h3>

      <p>
        По сравнению со стилизацией маркированных областей через CSS классы, этот способ менее гибкий. В приципе, если делать стилизацию через CSS классы, то нужно сделать стилизацию и через атрибут "style", это само собой напрашивается. Возможно кому-то этот способ больше понравится, в таком случае мы можем задать стили прямо в JS коде, что может быть удобно, всё таки это быстрее. Мы так-же получаем от сервера массив маркированных областей, одно из свойств каждой маркированной области говорит нам о результате распознавания маркированной области. Всё, что нам нужно, это заменить данное свойство на "muStyle, а дальше прописать в нём нужные CSS переменные. Ниже я приведу условный пример по стилизации маркированных областей, через атрибут "style". Наиболее важные места, где я задаю стили для стилизации маркированных областей я выделю (рядом с номером строки будет зелёная линия). Я бы вам посоветовал открыть <ui-link
          type="site"
          href="examples"
          title="Страница примеров"
          :query="query"
        >страницу примеров</ui-link> и посмотреть реальные примеры.
      </p>

      <stilization-attr-style />
    </template>

    <template v-if="props.isEng">
      <h2>
        Stylization of labeled areas
      </h2>
    </template>
  </div>
</template>

<script setup>
  import StilizationClass from '@/components/code/stilization/StilizationClass.vue';
  import StilizationAttrStyle from '@/components/code/stilization/StilizationAttrStyle.vue';

  const props = defineProps(['isEng', 'query']);
</script>

<style lang="scss">

</style>
